{"config": [{"config": {"function_type": "lambda", "trainable": true, "arguments": {}, "name": "Normalization", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-15-de053ce4d056>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "output_shape_type": "raw", "input_dtype": "float32", "batch_input_shape": [null, 11, 32, 1]}, "class_name": "Lambda"}, {"config": {"dim_ordering": "tf", "nb_row": 1, "subsample": [1, 1], "name": "convolution2d_1", "b_constraint": null, "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "bias": true, "border_mode": "same", "b_regularizer": null, "activation": "relu", "nb_col": 1, "activity_regularizer": null, "nb_filter": 2, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "same", "dim_ordering": "tf", "name": "maxpooling2d_1", "trainable": true, "strides": [4, 4], "pool_size": [4, 4]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.3, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "name": "dense_1", "b_constraint": null, "trainable": true, "input_dim": 48, "bias": true, "output_dim": 1, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}